<a href="https://colab.research.google.com/github/Sajina-S/titanic-survivor-analysis/blob/main/PROJECT.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **PROJECT-TITANIC SURVIVORS ANALYSIS**

In [ ]:
import pandas as pd
import numpy as np

## READING DATA IN TO PANDAS

Use ***read_csv*** function to read the csv file in python and pandas ***DataFrame*** method to convert file in to data frame.

In [ ]:
df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.describe()

NameError: ignored

In [ ]:
df.shape

(891, 12)

## HANDELING NULL VALUES

In [ ]:
#finging the null values
y = df.isnull().sum()
y

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
#Just drop the column which have more than 35% of the data missing.
drop_col = y[y>(35/100 * df.shape[0])]
drop_col

Cabin    687
dtype: int64

In [ ]:
df.shape

(891, 12)

In [ ]:
drop_col.index

Index(['Cabin'], dtype='object')

In [ ]:
df.drop(drop_col.index, axis=1, inplace=True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [ ]:
# column EMBARKED contains string values
df['Embarked'].fillna('S',inplace=True)

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         0
dtype: int64

In [ ]:
#handeling null values replaced by the mean of the column.
df.fillna(df.mean(), inplace=True)

In [ ]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

## CORRELATION OF THE ALL COLUMNS OF THE DATAFRAME

                                                                                                       

 To find the correlation of all columns in the dataframe we use **df.corr() **function

In [ ]:
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

In [ ]:
#group 'SibSp'and 'Parch' in to new column 'famsize'
df["famsize"] = df["SibSp"]+df["Parch"]
df.drop(['SibSp'], axis=1, inplace=True)
df.drop(['Parch'], axis=1, inplace=True)
df.corr()

             PassengerId  Survived    Pclass       Age      Fare   famsize
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658 -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307  0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500  0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566 -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000  0.217138
famsize        -0.040143  0.016639  0.065997 -0.248512  0.217138  1.000000

### Finding survivors with no family

In [ ]:
#creating a column 'NoFam' of people who has no family
df['NoFam']=[0 if df['famsize'][i]>0 else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked famsize  NoFam
0            1         0       3  ...        S       1      0
1            2         1       1  ...        C       1      0
2            3         1       3  ...        S       0      1
3            4         1       1  ...        S       1      0
4            5         0       3  ...        S       0      1

[5 rows x 11 columns]

In [ ]:
#Checking the chance of surviving of person who has no family
df.groupby(['NoFam'])['Survived'].mean()

NoFam
0    0.505650
1    0.303538
Name: Survived, dtype: float64

This means if the person is alone who has less chance of surviving!

In [ ]:
df[['NoFam','Fare']].corr()

          NoFam      Fare
NoFam  1.000000 -0.271832
Fare  -0.271832  1.000000

so the ticket price for lonely person is high.

In [ ]:
df['sex']=[0 if df['Sex'][i]=='male' else 1 for i in df.index]
df.groupby(['sex'])['Survived'].mean()

sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

so female passangers have more chance of surviving than males.
That is women where prioritized.

In [ ]:
#checking th survival chances of embarked passangers.
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

# **CONCLUSION**


1.   Passangers who are **alone** have **less chance** of survival rate.
2.   The passangers who are **rich** **and have family** have **more** chance to get survived **than** the **poor** alone passangers.
3.   **Female** passangers get prioritized over **male **passangers.
4.   The survivors who **borded the ship** have more survival rate than others.